
## Plan Result (terraform/cloudflare/b0xp.io/hitohub/stage)

[CI link](https://github.com/boxp/arch/actions/runs/8851808386)


<pre><code>Plan: 8 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_ssm_parameter.hitohub_stage_tunnel_token
  * cloudflare_access_application.hitohub_stage
  * cloudflare_access_policy.hitohub_stage_policy
  * cloudflare_record.api_hitohub_stage
  * cloudflare_record.hitohub_stage
  * cloudflare_tunnel.hitohub_stage_tunnel
  * cloudflare_tunnel_config.hitohub_stage_tunnel
  * random_password.tunnel_secret


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ssm_parameter.hitohub_stage_tunnel_token will be created
  + resource "aws_ssm_parameter" "hitohub_stage_tunnel_token" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "for hitohub stage tunnel token"
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "hitohub-stage-tunnel-token"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # cloudflare_access_application.hitohub_stage will be created
  + resource "cloudflare_access_application" "hitohub_stage" {
      + account_id                = (known after apply)
      + app_launcher_visible      = true
      + aud                       = (known after apply)
      + auto_redirect_to_identity = false
      + domain                    = "hitohub-stage.b0xp.io"
      + enable_binding_cookie     = false
      + id                        = (known after apply)
      + name                      = "Access application for hitohub-stage.b0xp.io"
      + service_auth_401_redirect = false
      + session_duration          = "24h"
      + skip_interstitial         = false
      + type                      = "self_hosted"
      + zone_id                   = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_access_policy.hitohub_stage_policy will be created
  + resource "cloudflare_access_policy" "hitohub_stage_policy" {
      + account_id     = (known after apply)
      + application_id = (known after apply)
      + decision       = "allow"
      + id             = (known after apply)
      + name           = "policy for hitohub-stage.b0xp.io"
      + precedence     = 1
      + zone_id        = "ec593206d0ef695c3aae3a4cb3173264"

      + include {
          + login_method = [
              + "b9248b7d-c1fa-48ab-8a43-ebffe03fabac",
            ]
        }
    }

  # cloudflare_record.api_hitohub_stage will be created
  + resource "cloudflare_record" "api_hitohub_stage" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api-hitohub-stage"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_record.hitohub_stage will be created
  + resource "cloudflare_record" "hitohub_stage" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "hitohub-stage"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_tunnel.hitohub_stage_tunnel will be created
  + resource "cloudflare_tunnel" "hitohub_stage_tunnel" {
      + account_id   = "1984a4314b3e75f3bedce97c7a8e0c81"
      + cname        = (known after apply)
      + id           = (known after apply)
      + name         = "cloudflare hitohub-stage tunnel"
      + secret       = (sensitive value)
      + tunnel_token = (sensitive value)
    }

  # cloudflare_tunnel_config.hitohub_stage_tunnel will be created
  + resource "cloudflare_tunnel_config" "hitohub_stage_tunnel" {
      + account_id = "1984a4314b3e75f3bedce97c7a8e0c81"
      + id         = (known after apply)
      + tunnel_id  = (known after apply)

      + config {
          + ingress_rule {
              + hostname = (known after apply)
              + service  = "http://hitohub-frontend:3000"
            }
          + ingress_rule {
              + hostname = (known after apply)
              + service  = "http://hitohub-back-end:8080"
            }
          + ingress_rule {
              + service = "http_status:404"
            }
        }
    }

  # random_password.tunnel_secret will be created
  + resource "random_password" "tunnel_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 64
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label terraform/cloudflare/b0xp.io/hitohub/stage/add-or-update: POST https://api.github.com/repos/boxp/arch/issues/322/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":322,"Program":"tfcmt","SHA1":"9689acd0fa4187f746b62aca7e3a22cd137d6874","Target":"terraform/cloudflare/b0xp.io/hitohub/stage","Vars":{},"WorkflowName":"pull_request_target"} -->